БСП_2_4_5/src/Catalogs/_ДемоПроекты/_ДемоПроекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ДемоПроекты</name>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентПроекта</name>
    <type>
      <types>CatalogRef._ДемоПроектыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef._ДемоОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef._ДемоПодразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

БСП_2_4_5/src/Catalogs/_ДемоПроекты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегламентПроектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентПроектаОткрытие(Элемент, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ОткрытьФормуФайла(Объект.РегламентПроекта, СтандартнаяОбработка);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НаписатьПисьмо(Команда)
	
	ПараметрыСообщения = Новый Структура();
	Если ЗначениеЗаполнено(Объект.РегламентПроекта) Тогда
		ПараметрыСообщения.Вставить("РегламентПроекта", Объект.РегламентПроекта);
	КонецЕсли;
	ПараметрыСообщения.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыСообщения.Вставить("Проект", Объект.Ссылка);
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтправкиСообщения", ЭтотОбъект);
	ШаблоныСообщенийКлиент.СформироватьСообщение(Объект.Организация, "Письмо", Оповещение, Объект.Подразделение, ПараметрыСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОтправкиСообщения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не удалось отправить сформированное письмо. Подробнее см. в журнале регистрации.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
